app/views/gossips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      <div class="card-body">
        <h5 class="card-title"><%= @user.find(t.user_id).first_name%></h5>