app/views/gossips/show.html.erb

        <p class="card-link"><%= link_to "Ville", city_path(@gossip.user.id) %> </p>
        <p class="card-link"><%= link_to @user.find(@gossip.user_id).first_name ,author_path(@gossip.user_id)%> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]