app/controllers/cities_controller.rb

def show

@cities = City.find(params[:id])
@user = User.all

@gossip = Gossip.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]