app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossip = Gossip.all

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdfregtr"], ["content", "dddddddddddddddddddddddddddddddddddddddddddddd"], ["user_id", 2], ["created_at", "2019-10-30 14:14:07.964195"], ["updated_at", "2019-10-30 14:14:07.964195"]]
---
  def create
    # Méthode qui créé un potin à partir du contenu du formulaircite de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
  #anonymous=User.new(first_name:"Anonymous", last_name:"unknown",age: 99,description: "unknown",email:"unknown#{rand(1000)}@mail.com",city_id:City.all.sample.id)
  #anonymous.save
  @gossip = Gossip.create(title: params[:title], content: params[:content], user_id: 2) # avec xxx qui sont les données obtenues à partir du formulaire

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    # Méthode qui récupère le potin concerné et l'envoie à la view edit (edit.html.erb) pour affichage dans un formulaire d'édition
  @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "nouveau titre"], ["content", "nouveau contenu blablabla"], ["updated_at", "2019-10-30 14:54:56.872419"], ["id", 7]]
---
  def update

     @gossip = Gossip.find(params[:id])
     post_params = params.permit(:title, :content)

     if @gossip.update(post_params, user_id: 2) #title: params[:title], content: params[:content]

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]
---
  def destroy
    # Méthode qui récupère le potin concerné et le détruit en base
    # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)


    @gossip = Gossip.find(params[:id])

   if  @gossip.destroy